emacs.org
#+title: Emacs
#+date: <2024-11-22 Fri>
#+author: Daniel Hazard
#+PROPERTY: header-args :tangle yes
This ~org~ file tangles to two different ~emacs-lisp~ files in the same directory: ~early-init.el~ and ~init.el~.
* early-init.el
:PROPERTIES:
:header-args: :tangle early-init.el
:END:
** GUI switches
Prevent window decorations from loading and remove outer padding. In other words, launch Emacs without a visible frame and ensure that there's no gap between Emacs and other windows.

#+begin_src emacs-lisp
  (add-to-list 'default-frame-alist '(undecorated-round . t))
  (setq frame-resize-pixelwise t)
#+end_src

Disable scroll-bar, tool-bar, start-up greeting message, and message at the top of Scratch buffers.

#+begin_src emacs-lisp
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (setq inhibit-startup-message t) 
  (setq initial-scratch-message nil)
#+end_src

** Native Compilation Cache Location
Preset for =no-littering= (from https://github.com/emacscollective/no-littering).
#+begin_src emacs-lisp
  (when (and (fboundp 'startup-redirect-eln-cache)
	     (fboundp 'native-comp-available-p)
	     (native-comp-available-p))
    (startup-redirect-eln-cache
     (convert-standard-filename
      (expand-file-name  "var/eln-cache/" user-emacs-directory))))
#+end_src

* init.el
:PROPERTIES:
:header-args: :tangle init.el
:END:
** no-littering

#+begin_src emacs-lisp
  (use-package no-littering)
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
#+end_src

** package management
#+begin_src emacs-lisp
  (setopt package-archives
	  '(("gnu" . "https://elpa.gnu.org/packages/")
	    ("nongnu" . "https://elpa.nongnu.org/nongnu/")
	    ("melpa" . "https://melpa.org/packages/")))
#+end_src

** Fonts and other styles

#+begin_src emacs-lisp
  (set-face-attribute 'default nil :font "Input Mono")
  (set-face-attribute 'fixed-pitch nil :font "Input Mono" :height 1.0)
  (set-face-attribute 'variable-pitch nil :font "Input Sans" :height 1.0)
  (global-visual-line-mode 1)
#+end_src

*** mixed-pitch-mode

#+begin_src emacs-lisp
  (use-package mixed-pitch
    :hook
    ;; If you want it in all text modes:
    (text-mode . mixed-pitch-mode))
#+end_src

** org-mode

#+begin_src emacs-lisp
  (use-package org
    :delight org-mode "org-mode"		; define mode-line lighter
    :custom
    (org-startup-indented t)
    (org-ellipsis " …")
    (set-face-underline 'org-ellipsis nil) ; remove underline from custom org-ellipsis
    (org-catch-invisible-edits 'show-and-error)
    (org-special-ctrl-a/e t)
    (org-insert-heading-respect-content t)
    (org-hide-emphasis-markers t)
    (org-pretty-entities t))
#+end_src

*** org-modern

#+begin_src emacs-lisp
  (use-package org-modern
    :ensure t
    :custom
    (org-modern-hide-stars nil)		; adds extra indentation
    (org-modern-block-name '("" . ""))
    (org-modern-fold-stars
     '(("►" . "▼") ("►" . "▼") ("►" . "▼") ("►" . "▼") ("►" . "▼")))
    :hook
    (org-mode . org-modern-mode))
#+end_src
**** org-modern-indent

#+begin_src emacs-lisp
  (use-package org-modern-indent
    :config ; add late to hook
    (add-hook 'org-mode-hook #'org-modern-indent-mode 90))
#+end_src

** Key-mapping and -binding
*** Modifiers Keys on MacOS
#+begin_src emacs-lisp
  (when (eq system-type 'darwin)
    (setq mac-command-modifier 'meta
          mac-option-modifier 'super
          mac-function-modifier 'hyper
          mac-right-option-modifier nil))
#+end_src

*** free-keys

#+begin_src emacs-lisp
  (use-package free-keys
    :custom
    (free-keys-modifiers '("" "C" "M" "C-M" "s" "H")))
#+end_src

** Completion and the Minibuffer
*** Save recent files
#+begin_src emacs-lisp
  (use-package recentf
    :config
    ;; (setq recentf-exclude '("COMMIT_MSG" "COMMIT_EDITMSG" "github.*txt$"
    ;;                         "[0-9a-f]\\{32\\}-[0-9a-f]\\{32\\}\\.org"
    ;;                         ".*png$" ".*cache$"))
    (setq recentf-max-saved-items 500))
#+end_src
*** Save minibuffer history
#+begin_src emacs-lisp
  (use-package savehist
    :init
    (savehist-mode))
#+end_src
*** Vertico
#+begin_src emacs-lisp
  (use-package vertico
    :init
    (vertico-mode))
#+end_src

