init.el
(use-package no-littering)
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))

(setopt package-archives
	'(("gnu" . "https://elpa.gnu.org/packages/")
	  ("nongnu" . "https://elpa.nongnu.org/nongnu/")
	  ("melpa" . "https://melpa.org/packages/")))

(when (eq system-type 'darwin)
  (set-face-attribute 'default nil :font "Input Mono"))
(global-visual-line-mode 1)

(use-package org
  :delight org-mode "org-mode"		; define mode-line lighter
  :custom
  (org-startup-indented t)
  (org-ellipsis " … ")
  (org-catch-invisible-edits 'show-and-error)
  (org-special-ctrl-a/e t)
  (org-insert-heading-respect-content t)
  (org-hide-emphasis-markers t)
  (org-pretty-entities t))

(use-package org-modern
  :ensure t
  :custom
  (org-modern-hide-stars nil)		; adds extra indentation
  (org-modern-block-name '("" . ""))
  (org-modern-fold-stars
   '(("►" . "▼") ("►" . "▼") ("►" . "▼") ("►" . "▼") ("►" . "▼")))
  :hook
  (org-mode . org-modern-mode))

(use-package org-modern-indent
  :config ; add late to hook
  (add-hook 'org-mode-hook #'org-modern-indent-mode 90))

(when (eq system-type 'darwin)
  (setq mac-command-modifier 'meta
	mac-left-option-modifier 'super
	mac-function-modifier 'hyper
	mac-right-option-modifier nil))

(use-package recentf
  :config
  ;; (setq recentf-exclude '("COMMIT_MSG" "COMMIT_EDITMSG" "github.*txt$"
  ;;                         "[0-9a-f]\\{32\\}-[0-9a-f]\\{32\\}\\.org"
  ;;                         ".*png$" ".*cache$"))
  (setq recentf-max-saved-items 500))

(use-package savehist
  :init
  (savehist-mode))

(use-package vertico
  :init
  (vertico-mode))

(use-package consult
