emacs.org
*** Corfu
#+begin_src emacs-lisp
  (use-package corfu
    ;; Optional customizations
    ;; :custom
    ;; (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
    ;; (corfu-auto t)                 ;; Enable auto completion
    ;; (corfu-separator ?\s)          ;; Orderless field separator
    ;; (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
    ;; (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
    ;; (corfu-preview-current nil)    ;; Disable current candidate preview
    ;; (corfu-preselect 'prompt)      ;; Preselect the prompt
    ;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches
    ;; (corfu-scroll-margin 5)        ;; Use scroll margin

    ;; Enable Corfu only for certain modes. See also `global-corfu-modes'.
    ;; :hook ((prog-mode . corfu-mode)
    ;;        (shell-mode . corfu-mode)
    ;;        (eshell-mode . corfu-mode))

    ;; Recommended: Enable Corfu globally.  This is recommended since Dabbrev can
    ;; be used globally (M-/).  See also the customization variable
    ;; `global-corfu-modes' to exclude certain modes.
    :init
    (global-corfu-mode))

  ;; A few more useful configurations...
  (use-package emacs
    :custom
    ;; TAB cycle if there are only few candidates
    ;; (completion-cycle-threshold 3)

    ;; Enable indentation+completion using the TAB key.
    ;; `completion-at-point' is often bound to M-TAB.
    (tab-always-indent 'complete)

    ;; Emacs 30 and newer: Disable Ispell completion function. As an alternative,
    ;; try `cape-dict'.
    (text-mode-ispell-word-completion nil)

    ;; Hide commands in M-x which do not apply to the current mode.  Corfu
    ;; commands are hidden, since they are not used via M-x. This setting is
    ;; useful beyond Corfu.
    (read-extended-command-predicate #'command-completion-default-include-p))

  ;; Use Dabbrev with Corfu!
  (use-package dabbrev
    ;; Swap M-/ and C-M-/
    :bind (("M-/" . dabbrev-completion)
	   ("C-M-/" . dabbrev-expand))
    :config
    (add-to-list 'dabbrev-ignored-buffer-regexps "\\` ")
    ;; Since 29.1, use `dabbrev-ignored-buffer-regexps' on older.
    (add-to-list 'dabbrev-ignored-buffer-modes 'doc-view-mode)
    (add-to-list 'dabbrev-ignored-buffer-modes 'pdf-view-mode)
    (add-to-list 'dabbrev-ignored-buffer-modes 'tags-table-mode))
#+end_src

*** Marginalia
#+begin_src emacs-lisp
  (use-package marginalia
    ;; Bind `marginalia-cycle' locally in the minibuffer.  To make the binding
    ;; available in the *Completions* buffer, add it to the
    ;; `completion-list-mode-map'.
    :bind (:map minibuffer-local-map
	   ("M-A" . marginalia-cycle))

    ;; The :init section is always executed.
    :init

    ;; Marginalia must be activated in the :init section of use-package such that
    ;; the mode gets enabled right away. Note that this forces loading the
    ;; package.
    (marginalia-mode))
#+end_src

*** which-key
#+begin_src emacs-lisp
  (use-package which-key
    :ensure t
    :config
    (which-key-mode))
#+end_src

*** transient
#+begin_src emacs-lisp
  (use-package transient)
#+end_src

** Writing, Editing, and Navigation
*** Better Default Commands
**** 
*** avy
#+begin_src emacs-lisp
  (use-package avy
    :ensure t
    :bind 
    ("s-q" . avy-goto-char))
#+end_src
*** ace-link

#+begin_src emacs-lisp
  (use-package ace-link
    :ensure t
    :config
    (ace-link-setup-default))
#+end_src

*** ace-window

#+begin_src emacs-lisp
  (use-package ace-window
    :ensure t
    :bind ("M-o". ace-window))
#+end_src

*** zoom-window

#+begin_src emacs-lisp
  (use-package zoom-window
    :ensure t
    :bind ("C-\\" . zoom-window-zoom))	; originally toggleinput-method
#+end_src

*** vundo
#+begin_src emacs-lisp
  (use-package vundo
    :ensure t
    :bind ("C-x u" . vundo))
#+end_src

*** expand-region
#+begin_src emacs-lisp
  (use-package expand-region
    :bind ("C-=" . er/expand-region))
#+end_src

*** denote

#+begin_src emacs-lisp
  (use-package denote
    :ensure t
    :bind (("C-c n n" . denote)
	   ("C-c n s" . denote-subdirectory)
	   ("C-c n i" . denote-link)
	   ("C-c n l" . denote-link-find-file)
	   ("C-c n b" . denote-link-backlinks))
    :hook
    (dired-mode . denote-dired-mode)
    :custom
    (denote-directory "~/notes/"))

  (use-package consult-denote
    :ensure t
    :bind (("C-c n f" . consult-denote-find)
	   ("C-c n g" . consult-denote-grep))
    :config
    (consult-denote-mode 1))
#+end_src

*** yasnippet

#+begin_src emacs-lisp
  (use-package yasnippet
    :ensure t
    :config
    (yas-global-mode 1))

  (use-package yasnippet-snippets
    :ensure t
    :after yasnippet)
#+end_src

** Windows, Buffers, and Tabs
*** tab-bar
#+begin_src emacs-lisp
  ;; (setq tab-bar-show 1)                      ;; hide bar if <= 1 tabs open
  (customize-set-variable 'tab-bar-show nil) ; on customize-set-variable see https://emacs.stackexchange.com/a/106
  ;; (setq tab-bar-close-button-show nil)       ;; hide tab close / X button
  ;; (setq tab-bar-tab-hints nil) ;; show tab numbers
  ;; (setq tab-bar-format '(tab-bar-format-tabs tab-bar-separator)) ;; elements to include in bar
#+end_src

*** mode-line
**** minions
#+begin_src emacs-lisp
  (use-package minions
    :ensure t
    :config 
    (minions-mode 1))
#+end_src
**** mode-line-bell

#+begin_src emacs-lisp
  (use-package mode-line-bell
    :init (mode-line-bell-mode))
#+end_src

*** activities
#+begin_src emacs-lisp
  (use-package activities
    :init
    (activities-mode)
    (activities-tabs-mode)
    ;; Prevent `edebug' default bindings from interfering.
    (setq edebug-inhibit-emacs-lisp-mode-bindings t)

    :bind
    (("C-x C-a C-n" . activities-new)
     ("C-x C-a C-d" . activities-define)
     ("C-x C-a C-a" . activities-resume)
     ("C-x C-a C-s" . activities-suspend)
     ("C-x C-a C-k" . activities-kill)
     ("C-x C-a RET" . activities-switch)
     ("C-x C-a b" . activities-switch-buffer)
     ("C-x C-a g" . activities-revert)
     ("C-x C-a l" . activities-list)))
#+end_src

*** popper
#+begin_src emacs-lisp
  (use-package popper
    :ensure t
    :bind (("s--"   . popper-toggle)
	   ("s-="   . popper-cycle)
	   ("s-_" . popper-toggle-type))
    :init
    (setq popper-reference-buffers
	  '("\\*Messages\\*"
	    "Output\\*$"
	    "\\*Async Shell Command\\*"
	    help-mode
	    compilation-mode))
    (popper-mode +1)
    (popper-echo-mode +1))
#+end_src

** dired
#+begin_src emacs-lisp
  (setq dired-dwim-target t)
#+end_src
*** dired+
#+begin_src emacs-lisp
  (use-package dired+)
#+end_src

*** casual-dired
#+begin_src emacs-lisp
  (use-package casual-dired
    :commands casual-dired-tmenu
    :bind (:map dired-mode-map ("C-z d h" . #'casual-dired-tmenu)))
#+end_src

** Version Control
*** magit
#+begin_src emacs-lisp
  (use-package magit
    :bind (("C-x g" . magit-status)
	   ("C-x C-g" . magit-status)))
#+end_src
** Programming

#+begin_src emacs-lisp
  (use-package treesit-auto
    :config
    (global-treesit-auto-mode))

  (use-package geiser-mit 
    :ensure t
    :config
    (setq geiser-racket-binary (executable-find "Racket")))

  (use-package ultra-scroll-mac
    :if (eq window-system 'mac)
    ;:load-path "~/code/emacs/ultra-scroll-mac" ; if you git clone'd instead of package-vc-install
    :init
    (setq scroll-conservatively 101 ; important!
	  scroll-margin 0) 
    :config
    (ultra-scroll-mac-mode 1))

  (use-package py-vterm-interaction
    :hook (python-mode . py-vterm-interaction-mode)
    :config
    ;;; Suggested:
    ;; (setq-default py-vterm-interaction-repl-program "ipython")
    ;; (setq-default py-vterm-interaction-silent-cells t)
    )
#+end_src

*** treesit
*** python
*** racket
** pdf-tools

#+begin_src emacs-lisp
  (use-package pdf-tools
   :pin manual ;; manually update
   :mode  ("\\.pdf\\'" . pdf-view-mode)
   :config
   ;; initialise
   (pdf-tools-install :no-query)
   ;; open pdfs scaled to fit page
   (setq-default pdf-view-display-size 'fit-width)
   ;; automatically annotate highlights
   (setq pdf-annot-activate-created-annotations t)
   ;; use normal isearch
   (define-key pdf-view-mode-map (kbd "C-s") 'isearch-forward))
#+end_src
